## Name: Mahboob Ali
## Sec: C
## Roll Num: 119
## Lab 5
## SAP ID: 5000000302

## Task 1

In [60]:
import pandas as pd

numb= pd.Series([22,34,55,67,88] ,index=['a','b','c','d','e'])
    

numb

a    22
b    34
c    55
d    67
e    88
dtype: int64

## Task 2

In [61]:

names={
'Name':["mahboob","Azad","Younus","Yasir"],
'Age':[ 20,21,35,23],
'Marks': [87,54,32,99]}
df=pd.DataFrame(names)

df

      Name  Age  Marks
0  mahboob   20     87
1     Azad   21     54
2   Younus   35     32
3    Yasir   23     99

## Task 3

In [62]:
df['Name']

0    mahboob
1       Azad
2     Younus
3      Yasir
Name: Name, dtype: object

## Task 4

In [63]:
df[df['Marks']>80]

      Name  Age  Marks
0  mahboob   20     87
3    Yasir   23     99

## Task 5

In [64]:
df['Passed'] = df['Marks'] > 50
print(df)

      Name  Age  Marks  Passed
0  mahboob   20     87    True
1     Azad   21     54    True
2   Younus   35     32   False
3    Yasir   23     99    True

## Task 6

In [65]:
df.drop('Marks',axis=1)

      Name  Age  Passed
0  mahboob   20    True
1     Azad   21    True
2   Younus   35   False
3    Yasir   23    True

## Task 7

max= df.max()
print("Max Marks",max)
min= df.min()
print("min Marks",min)
avg= df.mean(numeric_only= True)
print("average Marks",avg)

## Task 8

In [66]:
print(df.to_csv('students_csv',index=False))
print(pd.read_csv('students_csv'))

None
      Name  Age  Marks  Passed
0  mahboob   20     87    True
1     Azad   21     54    True
2   Younus   35     32   False
3    Yasir   23     99    True

## Task 9

In [67]:
print(df.loc[1])
print(df.iloc[0])

Name      Azad
Age         21
Marks       54
Passed    True
Name: 1, dtype: object
Name      mahboob
Age            20
Marks          87
Passed       True
Name: 0, dtype: object

## Task 10

In [68]:
df.describe( )

             Age      Marks
count   4.000000   4.000000
mean   24.750000  68.000000
std     6.946222  30.626786
min    20.000000  32.000000
25%    20.750000  48.500000
50%    22.000000  70.500000
75%    26.000000  90.000000
max    35.000000  99.000000

## Task 11

In [69]:
print(pd.read_csv('students.csv'))

    StudentID     Name  Age Gender  Score  Passed
0           1      Ali   23      M     85    True
1           2     Sara   21      F     90    True
2           3     John   25      M     88    True
3           4    Aisha   22      F     45   False
4           5     Omar   24      M     60    True
5           6   Fatima   20      F     72    True
6           7     Zain   23      M     35   False
7           8     Hina   22      F     95    True
8           9    Bilal   21      M     55    True
9          10     Sana   24      F     67    True
10         11    Rehan   23      M     42   False
11         12   Maryam   20      F     88    True
12         13    Hamza   25      M     76    True
13         14     Noor   22      F     59   False
14         15   Danish   24      M     81    True
15         16   Ayesha   21      F     73    True
16         17     Sami   23      M     68    True
17         18     Zoya   20      F     92    True
18         19   Faizan   22      M     47   False
19         20  Mahnoor   23      F     79    True

In [70]:
df= pd.read_csv('students.csv')
df.head((5))

   StudentID   Name  Age Gender  Score  Passed
0          1    Ali   23      M     85    True
1          2   Sara   21      F     90    True
2          3   John   25      M     88    True
3          4  Aisha   22      F     45   False
4          5   Omar   24      M     60    True

In [71]:
df.tail(5)

    StudentID     Name  Age Gender  Score  Passed
15         16   Ayesha   21      F     73    True
16         17     Sami   23      M     68    True
17         18     Zoya   20      F     92    True
18         19   Faizan   22      M     47   False
19         20  Mahnoor   23      F     79    True

In [72]:
print(df.shape)
df.columns

(20, 6)

Index(['StudentID', 'Name', 'Age', 'Gender', 'Score', 'Passed'], dtype='object')

## Task 12

In [73]:
df["Name"]

0         Ali
1        Sara
2        John
3       Aisha
4        Omar
5      Fatima
6        Zain
7        Hina
8       Bilal
9        Sana
10      Rehan
11     Maryam
12      Hamza
13       Noor
14     Danish
15     Ayesha
16       Sami
17       Zoya
18     Faizan
19    Mahnoor
Name: Name, dtype: object

In [74]:
df[["Name","Score"]]

       Name  Score
0       Ali     85
1      Sara     90
2      John     88
3     Aisha     45
4      Omar     60
5    Fatima     72
6      Zain     35
7      Hina     95
8     Bilal     55
9      Sana     67
10    Rehan     42
11   Maryam     88
12    Hamza     76
13     Noor     59
14   Danish     81
15   Ayesha     73
16     Sami     68
17     Zoya     92
18   Faizan     47
19  Mahnoor     79

## Task 13

In [75]:
df.iloc[1]

StudentID       2
Name         Sara
Age            21
Gender          F
Score          90
Passed       True
Name: 1, dtype: object

In [76]:
df.loc[3]

StudentID        4
Name         Aisha
Age             22
Gender           F
Score           45
Passed       False
Name: 3, dtype: object

## Task 14

In [77]:
df[df["Score"]>80]

    StudentID    Name  Age Gender  Score  Passed
0           1     Ali   23      M     85    True
1           2    Sara   21      F     90    True
2           3    John   25      M     88    True
7           8    Hina   22      F     95    True
11         12  Maryam   20      F     88    True
14         15  Danish   24      M     81    True
17         18    Zoya   20      F     92    True

In [78]:
df[df["Passed"]==True]

    StudentID     Name  Age Gender  Score  Passed
0           1      Ali   23      M     85    True
1           2     Sara   21      F     90    True
2           3     John   25      M     88    True
4           5     Omar   24      M     60    True
5           6   Fatima   20      F     72    True
7           8     Hina   22      F     95    True
8           9    Bilal   21      M     55    True
9          10     Sana   24      F     67    True
11         12   Maryam   20      F     88    True
12         13    Hamza   25      M     76    True
14         15   Danish   24      M     81    True
15         16   Ayesha   21      F     73    True
16         17     Sami   23      M     68    True
17         18     Zoya   20      F     92    True
19         20  Mahnoor   23      F     79    True

## Task 15

In [79]:

df['Grade'] = 'C'  # Default value
df.loc[df['Score'] >= 70, 'Grade'] = 'B'
df.loc[df['Score'] >= 85, 'Grade'] = 'A'
df

    StudentID     Name  Age Gender  Score  Passed Grade
0           1      Ali   23      M     85    True     A
1           2     Sara   21      F     90    True     A
2           3     John   25      M     88    True     A
3           4    Aisha   22      F     45   False     C
4           5     Omar   24      M     60    True     C
5           6   Fatima   20      F     72    True     B
6           7     Zain   23      M     35   False     C
7           8     Hina   22      F     95    True     A
8           9    Bilal   21      M     55    True     C
9          10     Sana   24      F     67    True     C
10         11    Rehan   23      M     42   False     C
11         12   Maryam   20      F     88    True     A
12         13    Hamza   25      M     76    True     B
13         14     Noor   22      F     59   False     C
14         15   Danish   24      M     81    True     B
15         16   Ayesha   21      F     73    True     B
16         17     Sami   23      M     68    True     C
17         18     Zoya   20      F     92    True     A
18         19   Faizan   22      M     47   False     C
19         20  Mahnoor   23      F     79    True     B

## Task 16

In [80]:
df= df.drop('Passed',axis=1) 
df

    StudentID     Name  Age Gender  Score Grade
0           1      Ali   23      M     85     A
1           2     Sara   21      F     90     A
2           3     John   25      M     88     A
3           4    Aisha   22      F     45     C
4           5     Omar   24      M     60     C
5           6   Fatima   20      F     72     B
6           7     Zain   23      M     35     C
7           8     Hina   22      F     95     A
8           9    Bilal   21      M     55     C
9          10     Sana   24      F     67     C
10         11    Rehan   23      M     42     C
11         12   Maryam   20      F     88     A
12         13    Hamza   25      M     76     B
13         14     Noor   22      F     59     C
14         15   Danish   24      M     81     B
15         16   Ayesha   21      F     73     B
16         17     Sami   23      M     68     C
17         18     Zoya   20      F     92     A
18         19   Faizan   22      M     47     C
19         20  Mahnoor   23      F     79     B

In [81]:
df= df.drop(2)
df

    StudentID     Name  Age Gender  Score Grade
0           1      Ali   23      M     85     A
1           2     Sara   21      F     90     A
3           4    Aisha   22      F     45     C
4           5     Omar   24      M     60     C
5           6   Fatima   20      F     72     B
6           7     Zain   23      M     35     C
7           8     Hina   22      F     95     A
8           9    Bilal   21      M     55     C
9          10     Sana   24      F     67     C
10         11    Rehan   23      M     42     C
11         12   Maryam   20      F     88     A
12         13    Hamza   25      M     76     B
13         14     Noor   22      F     59     C
14         15   Danish   24      M     81     B
15         16   Ayesha   21      F     73     B
16         17     Sami   23      M     68     C
17         18     Zoya   20      F     92     A
18         19   Faizan   22      M     47     C
19         20  Mahnoor   23      F     79     B

## Task 17

In [88]:
s_score=df.sort_values("Score",ascending=False)
s_score

    StudentID     Name  Age Gender  Score Grade
7           8     Hina   22      F     95     A
17         18     Zoya   20      F     92     A
1           2     Sara   21      F     90     A
11         12   Maryam   20      F     88     A
0           1      Ali   23      M     85     A
14         15   Danish   24      M     81     B
19         20  Mahnoor   23      F     79     B
12         13    Hamza   25      M     76     B
15         16   Ayesha   21      F     73     B
5           6   Fatima   20      F     72     B
16         17     Sami   23      M     68     C
9          10     Sana   24      F     67     C
4           5     Omar   24      M     60     C
13         14     Noor   22      F     59     C
8           9    Bilal   21      M     55     C
18         19   Faizan   22      M     47     C
3           4    Aisha   22      F     45     C
10         11    Rehan   23      M     42     C
6           7     Zain   23      M     35     C

In [89]:
s_score=df.sort_values("Score",ascending=True)
s_score

    StudentID     Name  Age Gender  Score Grade
6           7     Zain   23      M     35     C
10         11    Rehan   23      M     42     C
3           4    Aisha   22      F     45     C
18         19   Faizan   22      M     47     C
8           9    Bilal   21      M     55     C
13         14     Noor   22      F     59     C
4           5     Omar   24      M     60     C
9          10     Sana   24      F     67     C
16         17     Sami   23      M     68     C
5           6   Fatima   20      F     72     B
15         16   Ayesha   21      F     73     B
12         13    Hamza   25      M     76     B
19         20  Mahnoor   23      F     79     B
14         15   Danish   24      M     81     B
0           1      Ali   23      M     85     A
11         12   Maryam   20      F     88     A
1           2     Sara   21      F     90     A
17         18     Zoya   20      F     92     A
7           8     Hina   22      F     95     A

## Task 18

In [95]:
print("Sum:",df['Score'].sum())

Sum: 1309

In [96]:
print("Max",df['Score'].max())

Max 95

In [98]:
print("Min",df['Score'].min())

Min 35

In [102]:
print("Average",df['Age'].mean())

Average 22.263157894736842

In [103]:
df.describe()

       StudentID        Age      Score
count  19.000000  19.000000  19.000000
mean   10.894737  22.263158  68.894737
std     5.801290   1.484816  18.116582
min     1.000000  20.000000  35.000000
25%     6.500000  21.000000  57.000000
50%    11.000000  22.000000  72.000000
75%    15.500000  23.000000  83.000000
max    20.000000  25.000000  95.000000

## Task 19

In [105]:
df.to_csv('students_modified',index=False)